apojomovsky/epic-hal/pic18fxx5x-hal/src/core/pic18_harness_sim_target.c
/**
 * @file    pic18_harness_sim_target.c
 * @brief   PIC18F2455-family sim-target implementation of the test
 *          harness (see core/pic8_harness.h). Runs as real compiled
 *          firmware under MPLAB SIM (driven headlessly via mdb, see
 *          docs/ci-plan.md Phase 2), not a host-side simulator like
 *          pic18_harness_sim.c.
 *
 * @details
 *   Mirrors pic16_harness_sim_target.c exactly; see that file's header
 *   comment for the full rationale (why this lives per-family rather
 *   than in pic8-common, why init/tick stay no-ops while running()
 *   becomes bounded, why log() is a raw byte writer and not a real
 *   printf, why the TxCpltCallback workaround is safe here). Only the
 *   EUSART API surface differs: pic18fxx5x_usart.h's USART_ComputeSPBRG
 *   takes an extra BRG-width argument (USART_BAUDGEN_8BIT here, same
 *   8-bit SPBRG range as the PIC16 driver, simplest choice for a fixed
 *   9600 baud marker line), and its handle has extra fields
 *   (USART_HANDLE_DEFAULT already zero-initializes all of them).
 */

#include "core/pic8_harness.h"
#include "peripherals/pic18fxx5x_usart.h"

#include <stdint.h>

#ifndef FOSC_HZ
#define FOSC_HZ 48000000UL
#endif

#define PIC8_HARNESS_SIM_BAUD 9600UL

static uint32_t g_cycles = 0U;

static void s_tx_cplt(void)
{
    /* Exists only so HAL_USART_Init's TXEN/TXIE gate sees a non-null
     * callback (see pic16_harness_sim_target.c's header comment).
     * Transmission below is polled, this is never actually called in a
     * way that matters. */
}

static void s_uart_putc(char c)
{
    while (!HAL_USART_IsTxShiftRegisterEmpty()) {
        /* wait for the shift register to drain */
    }
    HAL_USART_Transmit((uint8_t)c);
}

void pic8_harness_init(uint32_t cycles)
{
    g_cycles = cycles;

    USART_HandleTypeDef h = USART_HANDLE_DEFAULT;
    h.SPBRG = (uint8_t)USART_ComputeSPBRG(FOSC_HZ, PIC8_HARNESS_SIM_BAUD,
                                           USART_MODE_ASYNCHRONOUS,
                                           USART_BRGH_HIGH,
                                           USART_BAUDGEN_8BIT);
    h.TxCpltCallback = s_tx_cplt;
    (void)HAL_USART_Init(&h);
}

void pic8_harness_tick(void)
{
    /* Real time advances on its own under MPLAB SIM too, nothing to pump. */
}

int pic8_harness_running(uint32_t iteration)
{
    return (iteration < g_cycles) ? 1 : 0;
}

void pic8_harness_log(const char *fmt, ...)
{
    while (*fmt) {
        s_uart_putc(*fmt);
        fmt++;
    }
}
